In [1]:
import pandas as pd 
import numpy as np

In [2]:
# load the data
data = pd.read_csv('/DataScienceNotes/Assignments/09-Data Transformation/adult_with_headers.csv')

In [3]:
data.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education_num   32561 non-null  int64
 5   marital_status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital_gain    32561 non-null  int64
 11  capital_loss    32561 non-null  int64
 12  hours_per_week  32561 non-null  int64
 13  native_country  32561 non-null  object
 14  income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [5]:
data.describe()

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

#### 1. Handle missing values

In [6]:
# check the null values
data.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
income            0
dtype: int64

In [7]:
# check unique values in the categorical columns
data['occupation'].unique()

array([' Adm-clerical', ' Exec-managerial', ' Handlers-cleaners',
       ' Prof-specialty', ' Other-service', ' Sales', ' Craft-repair',
       ' Transport-moving', ' Farming-fishing', ' Machine-op-inspct',
       ' Tech-support', ' ?', ' Protective-serv', ' Armed-Forces',
       ' Priv-house-serv'], dtype=object)

##### found a '?',  represents the missing values in the column so need to replace with 'NaN'
##### need to check other categorical columns too.

In [8]:
# checking each categorical column having any placeholders('?', 'NA', 'NULL'..etc) other than null values.
for col in data.select_dtypes(include="object").columns:
    print(f"{col}",data[col].unique())

workclass [' State-gov' ' Self-emp-not-inc' ' Private' ' Federal-gov' ' Local-gov'
 ' ?' ' Self-emp-inc' ' Without-pay' ' Never-worked']
education [' Bachelors' ' HS-grad' ' 11th' ' Masters' ' 9th' ' Some-college'
 ' Assoc-acdm' ' Assoc-voc' ' 7th-8th' ' Doctorate' ' Prof-school'
 ' 5th-6th' ' 10th' ' 1st-4th' ' Preschool' ' 12th']
marital_status [' Never-married' ' Married-civ-spouse' ' Divorced'
 ' Married-spouse-absent' ' Separated' ' Married-AF-spouse' ' Widowed']
occupation [' Adm-clerical' ' Exec-managerial' ' Handlers-cleaners' ' Prof-specialty'
 ' Other-service' ' Sales' ' Craft-repair' ' Transport-moving'
 ' Farming-fishing' ' Machine-op-inspct' ' Tech-support' ' ?'
 ' Protective-serv' ' Armed-Forces' ' Priv-house-serv']
relationship [' Not-in-family' ' Husband' ' Wife' ' Own-child' ' Unmarried'
 ' Other-relative']
race [' White' ' Black' ' Asian-Pac-Islander' ' Amer-Indian-Eskimo' ' Other']
sex [' Male' ' Female']
native_country [' United-States' ' Cuba' ' Jamaica' ' India' ' ?' ' Mexico' ' South'
 ' Puerto-Rico' ' Honduras' ' England' ' Canada' ' Germany' ' Iran'
 ' Philippines' ' Italy' ' Poland' ' Columbia' ' Cambodia' ' Thailand'
 ' Ecuador' ' Laos' ' Taiwan' ' Haiti' ' Portugal' ' Dominican-Republic'
 ' El-Salvador' ' France' ' Guatemala' ' China' ' Japan' ' Yugoslavia'
 ' Peru' ' Outlying-US(Guam-USVI-etc)' ' Scotland' ' Trinadad&Tobago'
 ' Greece' ' Nicaragua' ' Vietnam' ' Hong' ' Ireland' ' Hungary'
 ' Holand-Netherlands']
income [' <=50K' ' >50K']

#### 'workclass', 'occupation' & 'native_country', these columns are having "?", so replace them with 'nan'

In [9]:
# replacing placeholder with nan
data.replace("?", np.nan, inplace=True)

In [10]:
# verifing that it is replaced
data['workclass'].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

#### not replaced because of leeding space in  " ?" this.

In [11]:
# so to avoid that spaces in the place holders better to use.
data[data.select_dtypes(include="object").columns] = (
    data.select_dtypes(include="object").apply(lambda x:x.str.strip())
)
data.replace("?", np.nan, inplace=True)

In [12]:
# verifying that replaced values
data['workclass'].unique()

array(['State-gov', 'Self-emp-not-inc', 'Private', 'Federal-gov',
       'Local-gov', nan, 'Self-emp-inc', 'Without-pay', 'Never-worked'],
      dtype=object)

In [13]:
# checking null values, now itll show the null values of categorical column
data.isna().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education_num        0
marital_status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital_gain         0
capital_loss         0
hours_per_week       0
native_country     583
income               0
dtype: int64

In [14]:
# checking the zero's in the numerical column and set them with median value
for col in data.select_dtypes(include=["int64", "float64"]).columns:
    print(f"{col}",data[col].unique())

# data['capital_gain'].unique()

age [39 50 38 53 28 37 49 52 31 42 30 23 32 40 34 25 43 54 35 59 56 19 20 45
 22 48 21 24 57 44 41 29 18 47 46 36 79 27 67 33 76 17 55 61 70 64 71 68
 66 51 58 26 60 90 75 65 77 62 63 80 72 74 69 73 81 78 88 82 83 84 85 86
 87]
fnlwgt [ 77516  83311 215646 ...  34066  84661 257302]
education_num [13  9  7 14  5 10 12 11  4 16 15  3  6  2  1  8]
capital_gain [ 2174     0 14084  5178  5013  2407 14344 15024  7688 34095  4064  4386
  7298  1409  3674  1055  3464  2050  2176   594 20051  6849  4101  1111
  8614  3411  2597 25236  4650  9386  2463  3103 10605  2964  3325  2580
  3471  4865 99999  6514  1471  2329  2105  2885 25124 10520  2202  2961
 27828  6767  2228  1506 13550  2635  5556  4787  3781  3137  3818  3942
   914   401  2829  2977  4934  2062  2354  5455 15020  1424  3273 22040
  4416  3908 10566   991  4931  1086  7430  6497   114  7896  2346  3418
  3432  2907  1151  2414  2290 15831 41310  4508  2538  3456  6418  1848
  3887  5721  9562  1455  2036  1831 11678  2936  2993  7443  6360  1797
  1173  4687  6723  2009  6097  2653  1639 18481  7978  2387  5060]
capital_loss [   0 2042 1408 1902 1573 1887 1719 1762 1564 2179 1816 1980 1977 1876
 1340 2206 1741 1485 2339 2415 1380 1721 2051 2377 1669 2352 1672  653
 2392 1504 2001 1590 1651 1628 1848 1740 2002 1579 2258 1602  419 2547
 2174 2205 1726 2444 1138 2238  625  213 1539  880 1668 1092 1594 3004
 2231 1844  810 2824 2559 2057 1974  974 2149 1825 1735 1258 2129 2603
 2282  323 4356 2246 1617 1648 2489 3770 1755 3683 2267 2080 2457  155
 3900 2201 1944 2467 2163 2754 2472 1411]
hours_per_week [40 13 16 45 50 80 30 35 60 20 52 44 15 25 38 43 55 48 58 32 70  2 22 56
 41 28 36 24 46 42 12 65  1 10 34 75 98 33 54  8  6 64 19 18 72  5  9 47
 37 21 26 14  4 59  7 99 53 39 62 57 78 90 66 11 49 84  3 17 68 27 85 31
 51 77 63 23 87 88 73 89 97 94 29 96 67 82 86 91 81 76 92 61 74 95]

In [15]:
# now fill the missing values, medain for the numerical and mode for the categorical one.
# make sepration of numerical and categorical coluns
num_col = data.select_dtypes(include=["int64", "float64"]).columns
cat_col = data.select_dtypes(include="object").columns
# num_col, cat_col

In [16]:
# for numerical columns to replace 0's that is not exactly refered as null as its int 
for col in num_col:
    median = data.loc[data[col] !=0, col].median()
    data.loc[data[col] == 0, col] = median

# medain is calculated excluding zeros
# replace only valid zeros

In [17]:
# fill mode value to the categorical columns
for col in cat_col:
    data[col].fillna(data[col].mode()[0], inplace=True)

In [18]:
# verifying that all null values are cleared 
data.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
income            0
dtype: int64

In [19]:
data['capital_loss'].unique()

array([1887, 2042, 1408, 1902, 1573, 1719, 1762, 1564, 2179, 1816, 1980,
       1977, 1876, 1340, 2206, 1741, 1485, 2339, 2415, 1380, 1721, 2051,
       2377, 1669, 2352, 1672,  653, 2392, 1504, 2001, 1590, 1651, 1628,
       1848, 1740, 2002, 1579, 2258, 1602,  419, 2547, 2174, 2205, 1726,
       2444, 1138, 2238,  625,  213, 1539,  880, 1668, 1092, 1594, 3004,
       2231, 1844,  810, 2824, 2559, 2057, 1974,  974, 2149, 1825, 1735,
       1258, 2129, 2603, 2282,  323, 4356, 2246, 1617, 1648, 2489, 3770,
       1755, 3683, 2267, 2080, 2457,  155, 3900, 2201, 1944, 2467, 2163,
       2754, 2472, 1411], dtype=int64)

##### Apply scaling techniques to numerical features

In [20]:
from sklearn.preprocessing import StandardScaler, MinMaxScaler

In [21]:
# applying Standard scaler
std_scaler = StandardScaler()
data_std = data.copy()

In [22]:
data_std[num_col] = std_scaler.fit_transform(data[num_col])

In [23]:
# in feature scaling Alll features contribute equally and faster convergence in optimization
# standard scaling is used when data follows normal distribution.

In [24]:
# applying mimmax scaler 
mm_scaler = MinMaxScaler()
data_mm = data.copy()

In [25]:
data_mm[num_col] = mm_scaler.fit_transform(data[num_col])

In [26]:
# minmax scaler is used when data is not normally distributed.

#### 2. Encoding Techniques:

In [27]:
# checking how many unique values in each cat_col
data[cat_col].nunique()

workclass          8
education         16
marital_status     7
occupation        14
relationship       6
race               5
sex                2
native_country    41
income             2
dtype: int64

In [28]:
# encoding rules 
# < 5 categories one-hot encoding
# < 5 categories label encoding

In [29]:
# one-hot encoding low cardinality
low_crd = [col for col in cat_col if data[col].nunique() < 5]
data = pd.get_dummies(data, columns=low_crd, drop_first=True)

In [30]:
# Label encoding high high cardinality
from sklearn.preprocessing import LabelEncoder
high_crd = [col for col in cat_col if col not in low_crd]
lbl = LabelEncoder()
for col in high_crd:
    data[col] = lbl.fit_transform(data[col])

In [31]:
# verifying line of code
data.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,capital_gain,capital_loss,hours_per_week,native_country,sex_Male,income_>50K
0,39,6,77516,9,13,4,0,1,4,2174,1887,40,38,1,0
1,50,5,83311,9,13,2,3,0,4,7298,1887,13,38,1,0
2,38,3,215646,11,9,0,5,1,4,7298,1887,40,38,1,0
3,53,3,234721,1,7,2,5,0,2,7298,1887,40,38,1,0
4,28,3,338409,9,13,2,9,5,2,7298,1887,40,4,0,0

#### 3. Feature Engineering:

In [32]:
# Feature 1. Capital net gain
data["capital_net"] = data["capital_gain"] - data["capital_loss"]
# chosen this net capital gain because it reflects actual investment income which strongly impacts income level

In [33]:
# Feature 2. Work intensity score
data["work_intensity"] = data["hours_per_week"] * data["education_num"]
# combines educational level and working hours, capturing earning potential more efectively

In [34]:
# compare skewness for all numerical features
num_cols = data.select_dtypes(include=["int64", "float64"]).columns
data[num_cols].skew().sort_values(ascending=False)

capital_gain      13.108170
capital_net       13.105168
fnlwgt             1.446980
capital_loss       1.165261
work_intensity     0.697997
age                0.558743
hours_per_week     0.227643
education_num     -0.311676
dtype: float64

In [35]:
# Among all numerical features, capital-gain exhibited extreme positive skewness with a long right tail
# Applying the transormation 
data["capital_gain_log"] = np.log1p(data["capital_gain"])
# log transformation will reduce the skewness and handel the large values improves model performance

In [36]:
# final ready data for model building
data.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,capital_gain,capital_loss,hours_per_week,native_country,sex_Male,income_>50K,capital_net,work_intensity,capital_gain_log
0,39,6,77516,9,13,4,0,1,4,2174,1887,40,38,1,0,287,520,7.684784
1,50,5,83311,9,13,2,3,0,4,7298,1887,13,38,1,0,5411,169,8.895493
2,38,3,215646,11,9,0,5,1,4,7298,1887,40,38,1,0,5411,360,8.895493
3,53,3,234721,1,7,2,5,0,2,7298,1887,40,38,1,0,5411,280,8.895493
4,28,3,338409,9,13,2,9,5,2,7298,1887,40,4,0,0,5411,520,8.895493